(() => {
  window.SchoolScheduleConfig = {
  "school": {
    "name": "Романівський ліцей імені М.Т. Рильського",
    "mainTitle": "Розклад уроків на ІІ семестр",
    "semesterLabel": "ІІ семестр • 2026 навчальний рік"
  },
  "classPagePath": "class.html",
  "homePagePath": "index.html",
  "bellsPagePath": "Розклад дзвінків.html",
  "classes": [
    "5 клас",
    "6 клас",
    "7 клас",
    "8 клас",
    "9 клас",
    "10 клас",
    "11 клас"
  ],
  "dayOrder": [
    {
      "id": "monday",
      "label": "Понеділок"
    },
    {
      "id": "tuesday",
      "label": "Вівторок"
    },
    {
      "id": "wednesday",
      "label": "Середа"
    },
    {
      "id": "thursday",
      "label": "Четвер"
    },
    {
      "id": "friday",
      "label": "П'ятниця"
    }
  ],
  "scheduleRows": [
    {
      "day": "Понеділок",
      "lesson": 1,
      "classes": [
        "Укр. мова",
        "Укр. мова",
        "Хімія",
        "Фізкультура",
        "Історія",
        "Фізика",
        "Географія"
      ]
    },
    {
      "day": "Понеділок",
      "lesson": 2,
      "classes": [
        "Пізнаю прир",
        "Історія",
        "Біологія",
        "Укр. мова",
        "Укр. літ",
        "Геометрія",
        "Алгебра"
      ]
    },
    {
      "day": "Понеділок",
      "lesson": 3,
      "classes": [
        "Математика",
        "Зарубіжна",
        "Фізкультура",
        "Географія",
        "Хімія",
        "Гром. освіта",
        "Геометрія"
      ]
    },
    {
      "day": "Понеділок",
      "lesson": 4,
      "classes": [
        "Укр. літ",
        "Фізкультура",
        "Географія",
        "Хімія",
        "Геометрія",
        "Укр. мова",
        "Історія"
      ]
    },
    {
      "day": "Понеділок",
      "lesson": 5,
      "classes": [
        "Зарубіжна",
        "Математика",
        "Укр. мова",
        "Алгебра",
        "Географія",
        "Біологія",
        "Історія р.к."
      ]
    },
    {
      "day": "Понеділок",
      "lesson": 6,
      "classes": [
        "",
        "",
        "",
        "Фізика",
        "Право",
        "Укр. літ",
        "Укр. мова"
      ]
    },
    {
      "day": "Понеділок",
      "lesson": 7,
      "classes": [
        "",
        "",
        "",
        "",
        "Фізкультура",
        "Історія р.к.",
        ""
      ]
    },
    {
      "day": "Вівторок",
      "lesson": 1,
      "classes": [
        "Фізкультура",
        "Укр. мова",
        "Геометрія",
        "Укр. мова",
        "Хімія",
        "Англ. мова",
        "Історія"
      ]
    },
    {
      "day": "Вівторок",
      "lesson": 2,
      "classes": [
        "Англ. мова",
        "Трудове",
        "Фізкультура",
        "Алгебра",
        "Укр. мова",
        "Історія",
        "Хімія"
      ]
    },
    {
      "day": "Вівторок",
      "lesson": 3,
      "classes": [
        "Математика",
        "Англ. мова",
        "Історія",
        "Укр. літ",
        "Алгебра",
        "Фізкультура",
        "Біологія"
      ]
    },
    {
      "day": "Вівторок",
      "lesson": 4,
      "classes": [
        "Історія",
        "Укр. літ",
        "Алгебра",
        "Біологія",
        "Фізкультура",
        "Зах. Укр",
        "Укр. мова"
      ]
    },
    {
      "day": "Вівторок",
      "lesson": 5,
      "classes": [
        "Укр. мова",
        "Математика",
        "Укр. мова",
        "Фізкультура",
        "Англ. мова",
        "Хімія",
        "Зах. Укр"
      ]
    },
    {
      "day": "Вівторок",
      "lesson": 6,
      "classes": [
        "",
        "",
        "Англ. мова",
        "",
        "Біологія",
        "Укр. мова",
        "Трудове"
      ]
    },
    {
      "day": "Вівторок",
      "lesson": 7,
      "classes": [
        "",
        "",
        "",
        "",
        "Трудове",
        "Біологія",
        "Фізкультура"
      ]
    },
    {
      "day": "Середа",
      "lesson": 0,
      "classes": [
        "",
        "",
        "",
        "Інформатика (1)",
        "",
        "",
        ""
      ]
    },
    {
      "day": "Середа",
      "lesson": 1,
      "classes": [
        "Фізкультура",
        "Музика",
        "Фізика",
        "Укр. мова",
        "Геометрія",
        "Геометрія",
        "Фізика"
      ]
    },
    {
      "day": "Середа",
      "lesson": 2,
      "classes": [
        "Укр. мова",
        "Математика",
        "Музика",
        "Англ. мова",
        "Основи здоров'я",
        "Фізкультура",
        "Алгебра"
      ]
    },
    {
      "day": "Середа",
      "lesson": 3,
      "classes": [
        "ЗБД",
        "Інформатика",
        "Зарубіжна",
        "Фізкультура",
        "Англ. мова",
        "Алгебра",
        "Астрономія"
      ]
    },
    {
      "day": "Середа",
      "lesson": 4,
      "classes": [
        "Математика",
        "Англ. мова",
        "Географія",
        "Геометрія",
        "Зарубіжна",
        "Інформатика",
        "Фізкультура"
      ]
    },
    {
      "day": "Середа",
      "lesson": 5,
      "classes": [
        "",
        "Фізкультура",
        "Англ. мова",
        "Фізика",
        "Інформатика",
        "Фізика",
        "Укр. мова"
      ]
    },
    {
      "day": "Середа",
      "lesson": 6,
      "classes": [
        "",
        "",
        "Фізкультура",
        "Інформатика (2)",
        "Фізика",
        "Зарубіжна",
        "Англ. мова"
      ]
    },
    {
      "day": "Середа",
      "lesson": 7,
      "classes": [
        "",
        "",
        "Інформатика (2)",
        "",
        "Фізкультура",
        "",
        "Укр. літ"
      ]
    },
    {
      "day": "Четвер",
      "lesson": 1,
      "classes": [
        "Фізкультура",
        "Англ. мова",
        "Біологія",
        "Історія",
        "Алгебра",
        "Укр. мова",
        "Зах. Укр"
      ]
    },
    {
      "day": "Четвер",
      "lesson": 2,
      "classes": [
        "Пізнаю прир",
        "Фізкультура",
        "Алгебра",
        "Англ. мова",
        "Укр. мова",
        "Трудове",
        "Біологія"
      ]
    },
    {
      "day": "Четвер",
      "lesson": 3,
      "classes": [
        "Англ. мова",
        "Укр. мова",
        "Геометрія",
        "Біологія",
        "Історія",
        "Трудове",
        "Фізкультура"
      ]
    },
    {
      "day": "Четвер",
      "lesson": 4,
      "classes": [
        "Трудове",
        "Географія",
        "Укр. мова",
        "Алгебра",
        "Історія р.к.",
        "Англ. мова",
        "Хімія"
      ]
    },
    {
      "day": "Четвер",
      "lesson": 5,
      "classes": [
        "",
        "Укр. мова",
        "Трудове",
        "Хімія",
        "Географія",
        "Фізкультура",
        "Фізика"
      ]
    },
    {
      "day": "Четвер",
      "lesson": 6,
      "classes": [
        "",
        "Пізнаю прир",
        "",
        "Трудове",
        "Біологія",
        "Укр. мова",
        "Англ. мова"
      ]
    },
    {
      "day": "Четвер",
      "lesson": 7,
      "classes": [
        "",
        "",
        "",
        "",
        "Фізика",
        "Зах. Укр",
        ""
      ]
    },
    {
      "day": "П'ятниця",
      "lesson": 0,
      "classes": [
        "",
        "",
        "",
        "Інформатика (2)",
        "",
        "",
        ""
      ]
    },
    {
      "day": "П'ятниця",
      "lesson": 1,
      "classes": [
        "Математика",
        "Історія",
        "Укр. мова",
        "Географія",
        "Англ. мова",
        "Інформатика",
        "Укр. мова"
      ]
    },
    {
      "day": "П'ятниця",
      "lesson": 2,
      "classes": [
        "Інформатика",
        "Укр. мова",
        "Історія",
        "Англ. мова",
        "Мистецтво",
        "Географія",
        "Зарубіжна"
      ]
    },
    {
      "day": "П'ятниця",
      "lesson": 3,
      "classes": [
        "Укр. мова",
        "Англ. мова",
        "Фізика",
        "Історія",
        "Укр. літ",
        "Фізика",
        "Інформатика"
      ]
    },
    {
      "day": "П'ятниця",
      "lesson": 4,
      "classes": [
        "Музика",
        "Математика",
        "Англ. мова",
        "Зарубіжна",
        "Фізика",
        "Укр. мова",
        "Історія"
      ]
    },
    {
      "day": "П'ятниця",
      "lesson": 5,
      "classes": [
        "Англ. мова",
        "ЗБД",
        "Укр. літ",
        "Мистецтво",
        "Інформатика",
        "Гром. освіта",
        "Укр. літ"
      ]
    },
    {
      "day": "П'ятниця",
      "lesson": 6,
      "classes": [
        "",
        "",
        "ЗБД",
        "Інформатика (1)",
        "Зарубіжна",
        "Історія",
        "Фізика"
      ]
    },
    {
      "day": "П'ятниця",
      "lesson": 7,
      "classes": [
        "",
        "",
        "Інформатика (1)",
        "",
        "",
        "",
        ""
      ]
    }
  ],
  "subjectAliasMap": {
    "алгебра": "Алгебра",
    "англ. мова": "Англ. мова",
    "астрономія": "Астрономія",
    "біологія": "Біологія",
    "географія": "Географія",
    "геометрія": "Геометрія",
    "гром. освіта": "Гром. освіта",
    "зарубіжна": "Зарубіжна",
    "зах. укр": "Зах. Укр",
    "збд": "ЗБД",
    "інформатика": "Інформатика",
    "історія": "Історія",
    "історія р.к.": "Історія р.к.",
    "математика": "Математика",
    "мистецтво": "Мистецтво",
    "музика": "Музика",
    "основи здоров'я": "Основи здоров'я",
    "пізнаю прир": "Пізнаю прир",
    "право": "Право",
    "трудове": "Трудове",
    "укр. літ": "Укр. літ",
    "укр. мова": "Укр. мова",
    "фізика": "Фізика",
    "фізкультура": "Фізкультура",
    "хімія": "Хімія"
  },
  "subjectIcons": {
    "Укр. мова": "🇺🇦",
    "Хімія": "🧪",
    "Фізкультура": "🏃",
    "Історія": "📜",
    "Фізика": "⚛️",
    "Географія": "🧭",
    "Пізнаю прир": "🐞",
    "Біологія": "🧬",
    "Укр. літ": "📖",
    "Геометрія": "📐",
    "Алгебра": "📉",
    "Математика": "🔢",
    "Зарубіжна": "🌐",
    "Гром. освіта": "⚖️",
    "Історія р.к.": "🌻",
    "Право": "⚖️",
    "Англ. мова": "🇬🇧",
    "Трудове": "🔨",
    "Зах. Укр": "🛡️",
    "Інформатика": "💻",
    "Музика": "🎵",
    "Основи здоров'я": "🩺",
    "ЗБД": "🍏",
    "Астрономія": "🔭",
    "Мистецтво": "🎨"
  },
  "bellSchedule": [
    {
      "lesson": 1,
      "start": "08:30",
      "end": "09:15"
    },
    {
      "lesson": 2,
      "start": "09:25",
      "end": "10:10"
    },
    {
      "lesson": 3,
      "start": "10:30",
      "end": "11:15"
    },
    {
      "lesson": 4,
      "start": "11:35",
      "end": "12:20"
    },
    {
      "lesson": 5,
      "start": "12:30",
      "end": "13:15"
    },
    {
      "lesson": 6,
      "start": "13:25",
      "end": "14:10"
    },
    {
      "lesson": 7,
      "start": "14:20",
      "end": "15:05"
    }
  ]
};
})();



